[
	{
		"id": 10329,
		"description": "Stayed here with husband and sons on the way to an Alaska Cruise. We all loved the hotel, great experience. Ask for a room on the North tower, facing north west for the best views. We had a high floor, with a stunning view of the needle, the city, and even the cruise ships! We ordered room service for dinner so we could enjoy the perfect views. Room service dinners were delicious, too! You are in a perfect spot to walk everywhere, so enjoy the city. Almost forgot- Heavenly beds were heavenly, too!",
		"browser": "InternetExplorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10331,
		"description": "We had - rooms. One was very nice and clearly had been updated more recently than the other. The other was clean and the bed was comfy but it needed some updating (carpet was old and wrinkled for example). Great location for visiting Inner Harbor, getting to Fells Point, Orioles games etc. SuperShuttle from BWI worked great both ways. TV remotes in both rooms were terrible but we didn't watch much TV so not a big deal. Wireless was sketchy on --th and --th floors but again, didn't need it much - we were on vacation so it didn't really matter. Breakfast was good each morning. Would stay again if in town.",
		"browser": "InternetExplorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10333,
		"description": "My wife & I stayed in this glorious city a while back. SF is expensive, but we found this little hotel in a super location for a very reasonable price. By no means is it a --star hotel, but the room was clean, nice & well-appointed with quaint charm, despite being a bit small. Regardless of that, the staff was very helpful. I particularly enjoyed the wine-tasting evenings & the helpful, polite front desk.\r\nOverall, I'd recommend this place for singles or couples, but for children present, you probably need a bit bigger room. For the location & proximity to everything (including a marvelous little Mexican restaurant around the corner), you can't beat this place for the price. SF is a magical city with plenty of things to do, so I'd recommend just crashing here & seeing the wonderful surroundings more than hanging out in a room all day.\r\nWould recommend again for a getaway for -, but not for families because of the room size.",
		"browser": "Google Chrome",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10334,
		"description": "My boyfriend and I stayed at the Fairmont on a recent trip to San Francisco. I could not recommend this hotel more. \r\nI called the hotel a few weeks before to order a cake to be delivered to our room on our first night to celebrate my boyfriend's birthday. I was immediately connected directly to the pastry chef who helped me to design the most delicious cake I have ever eaten in my entire life! \r\nThe rooms are large and luxurious with a wonderful old-world feel. \r\n Most importantly don't miss a dinner at the Tonga Room! What a fun restaurant. Definitely order a Scorpion Bowl, but only if you’re staying in the hotel -- they're strong!!",
		"browser": "Internet Explorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10336,
		"description": "Steps off Times Square, nice rooms, stayed - nights, great for a short visit.",
		"browser": "Internet Explorer",
		"device": "Tablet",
		"label": "positive"
	},
	{
		"id": 10337,
		"description": "Me, the Wife and - kids stayed here on Valentine's weekend ----. Really a nice hotel in a great location. It is connected to the Rivercenter Mall in downtown San Antonio. It is within walking distance of all Downtown SA attractions, (Alamo, Riverwalk, Ripley's, ETC.) Great Service from the staff from beginning to end. I definitely HIGHLY recommend this hotel and would stay here again if ever in San Antonio for any reason.",
		"browser": "IE",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10339,
		"description": "I highly recommend the Hawthorne Terrace as an affordable, comfortable spot in Chicago. The staff were pleasant, the room clean and spacious, and I really liked the neighborhood location. Tons of bars, restaurants, an improv spot and Wrigley Field are all within walking distance.\r\nWhile the hotel provides a Continental breakfast, I'd recommend going across the street (at least once) to Anne Sather's. The hotel also offers free wireless Internet access in the rooms. I would definitely stay here again!",
		"browser": "Internet Explorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10340,
		"description": "I found the hotel clean and nicely located. Good, free shuttle to the airport leaves twice per hour. The rooms aren't as nicely appointed as other springhill suited I have stayed at. The walls were thin I could hear a lot from adjacent rooms.",
		"browser": "Chrome",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10341,
		"description": "Stayed at the Elan from --th to --th October and, as we liked it so much, returned there after our - day trip to Vegas for another - nights. Unassuming in appearance, the hotel scores heavily for its great location, spotlessly clean, classically designed and very comfortable bedrooms, and the friendliness of management and staff. Jorge and his colleagues on the front desk were a revelation with their untiring and enthusiastic help in recommending great restaurants, places to visit etc. And management were particularly helpful in letting us have a complimentary room post-check out to freshen up for our evening flight home after a long day enjoying the Southern Cal sunshine.",
		"browser": "Mozilla",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10344,
		"description": "We stayed here for - nights and were really happy with it. It is located about --mins walk from the walk of fame and graumanns chinese theatre and is on most of the tour companie's pick up routes. Our room was nice and big and was very clean. Breakfast was included and it was really nice, the usual toast, cereal, pastries and cooked things. You also get free use of their internet in the business centre, as well as the gym and pool. The reception staff were really helpful in givin us directions etc. There is a minimart, subway and starbucks just across the road which is convenient. Also just off the walk of fame is a shopping mall with shops like Gap, Superdry, etc. There are also a few restaurants there as well. For anyone who likes pizzas I would recommend visiting the California Pizza Kitchen at the mall - pizzas are lush there and are rasonably priced. We got a shared bus to the hotel through Super Shuttle. It cost approx $-- return and pick ups occur every ----- mins from airport. Be warned of the way they drive tho, it was a slightly frightening experience after -- hours on a plane! \r\nWe didnt have a car there so did all organised tours, one through VIP tours and one through Starline Tours. The VIP tour was a tour of LA including Hollywood, Venice Beach, Downtown LA and Beverly HIlls. This lasted approx --- day and was really worth the money. We then did an escorted trip to Universal with Starline which was well organised and Universal is worth visiting!! We also went to Madame Tussauds on the walk of fame which had some good and bad statues!!\r\nOverall though the Holiday Inn Walk of Fame is worth staying at, its clean, convenient and has some nice free extras thrown in!!",
		"browser": "Google Chrome",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10330,
		"description": "My girlfriends and I stayed here to celebrate our --th birthdays. We had planned this weekend getaway back in February, so we were all looking forward to it. There was - of us so we rented - ajoining rooms at the rate of $----night-room. We stayed - nights so with taxes and parking charges we spent in total over $----. All of us expected a certain level of service since we were staying at the Ritz, however this hotel certainly didn't meet what we would consider Ritz standards.\r\nThe rooms were fine. They were clean with well appointed bathrooms, but nothing to get excited about. The service however was awful. The first night we were there, I made -- calls to the bell man, before someone in hotel communications picked up the phone. Then on Saturday night before we left for dinner at -:--, we requested to have extra hotels delivered to our room and our trash removed. When we returned at --:--, neither request was fullfilled. I made another call to housekeeping and then finally things were taken care of. In my opinion, for the rates we were paying, we should have had nightly turn down service.\r\nI did speak with a manager when we checked out and he said he would make it worth our while to return, however all we received was a letter of apology.\r\nNeedless to say, we have no plans to return to this hotel. My husband and I stayed at the Four Seasons Boston in February of ---- and had a wonderful stay. The service there was impeccable as is service at all the Four Seaons that I have stayed at. If you are willing to pay Ritz Carlton prices, then I would recommend staying at the Four Seasons instead!",
		"browser": "Edge",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10332,
		"description": "My husband and I have stayed in this hotel a few times. Though not the fanciest hotel, we love the fact that we can walk the - or so miles to Fenway. It is clean and the staff is very accomodating. My only complaint is that the fan in the bathroom was noisy and went on automatically when you turned the light on and we tried to keep the light off as much as possible. We've stayed in pricier hotels which charged for internet and breakfast and these are both included. Will stay there again.",
		"browser": "Firefox",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10335,
		"description": "Wonderful staff, great location, but it was definately the price was high for a standard hotel. The free breakfast was great, actually pretty good quailty for a free buffet. This hotel is in the heart of it all, walking distance to everything. - things, please Hyatt...the coffee was bad and the white ginger line of shampoo-conditioner-soap smells horrible!",
		"browser": "Chrome",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10338,
		"description": "We stay at the Jolly Madison over the Xmas period, the main feature is it's location. You are never far from most tourist attractions from this hotel. Grand Central Station is a short walk and gets you to other places you can't get to by walking (cheaper than yellow cabs - although you should also give this a go. We booked a cab with the hotel to take us back to the airport upon our departure and we got a limo - what a way to leave New York! This was certainly better than our inward travel. Got a transfer just outside the airport and spent -- minutes driving between terminals collecting other fares before arriving back at our original terminal and heading off to our hotel.\r\nOur room was on a top floor high which was great as it meant less traffic and street noise. We had some problems with the heater in our room but the reception staff eventually resolved this by providing us with a portable heater.\r\nWe did not eat at the hotel at all because diners and deli's are available in close proximity. The best meals we found were in China Town and at Planet Holywood. If you are planning to go to Planet Hollywood negotiate a travel within the main section of the restaurant before being shown to your table otherwise you may end up like us on the top floor overlooking the action and not in it.\r\nWe took part in typical tourist activities such as Ripleys and the CSI Experience. Disappointed with both unfortunately. Had hoped to see a broadway play but we left it to late and the only available tickts were $--- each. If you ant to get to the to of the Empire State bilding would suggest going early as the queue by mid-day will take at least an hour. The boat trips around New York are great and the best way to see the Statue of Liberty, The Brooklyn Bridge etc.\r\nMake sure you book the ---- Memorial at reception. Although very emotional it gives you a true understanding of the events which took place and an appreciation for life and the spirit of New Yorkers.\r\nThe store window displays, Xmas trees and ice skating rings are just amazing over Xmas. Ice skating on Xmas Eve on Xmas day was definetely a highlight and the Hot Chocolate with marshmallows and whipped cream is wonderful. Do be careful if paying for a padlock for the lockers. I forgot where ours was and soehow managed to gain access to someone elses ;-(\r\nStumbling across Times Square one evening whilst taking a stroll was enlightening literally. All of a sudden he colour of the sky was bright. There are so many illuminated signs and this area has a real buzz at night time. Didn't care too much for the hoards of people here during the day though.\r\nWe did use the hotel bar on our last evening. The bar man was nice and friendly. The bar room was a little odd and resembled a chapel or such like.\r\nWe were surprised at just how many people there were and how many shops remained open on Xmas day. This really is the town that does not sleep.\r\nOur only regret was not having longer than - days but there is always next time.",
		"browser": "Edge",
		"device": "Mobile",
		"label": "negative"
	},
	{
		"id": 10342,
		"description": "Priceline sent us to this hotel after accepting the bid at --- USD a night, tax included. We checked in the night before Thanksgiving with a family of four including my --year and --year old boys. Upon inquiry, the hotel staff gave us a room at the lowest level, the --th floor, facing Time Square. While this is a standard room at this hotel, we had a pleasant surprise the very next morning to watch the entire Macy's Thanksgiving Day Parade from the comfort of our room. The location of this hotel is just impeccable. I highly recommend those who wish to celebrate special events near Time Square to stay there. Maybe we will do it again for the New Year count down.",
		"browser": "Mozilla",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10343,
		"description": "Old and cheap furnitures,our chair was simply destroyed,old painting on the wall,you feel like you are back in the --'s not ----...Kids running non stop early morning next to our door starting -am...The entire room shake...And for $---.....I don't think so!",
		"browser": "Google Chrome",
		"device": "Desktop",
		"label": "negative"
	},
	{
		"id": 10345,
		"description": "The service was fine, but the hotel itself fell way below my expectations from such a respectable establishment as Hilton. They were nickel-and-diming me all the way. \r\n-. The carpet in the corridor is not very clean and it smelled weird there. The pool area was no better - actually, much worse. I wouldn't recommend going barefoot anywhere in that area. It's just dirty.\r\n-. The coffee maker in the room was broken - it made --- cup of coffee and then turned off. So if you want a full cup, you have to ask it - times. Of course, by then the cup is almost all cold. Good luck making tea with it, if you don't like ice tea.\r\n-. Once we have used the provided tea packs, room service didn't bother to replace them. Probably saved them a cent or so.\r\n-. There's no free internet access in the business center and no free printing. I am staying in various hotels a lot and wasn't used before to being charged dollar-a-minute for printing a simple page of driving directions. I was used to getting it for free, as it was in most hotels of this class I visited. Hilton, however, decided to save yet another ---- of a cent.\r\n-. Most hotels provide some sort of paper for the guests to write on. Hilton has post-it notes. Literally - tiny squares of paper, and that's it. If you want to write down something that's not - words - good luck, Hilton is not going to help, go find an Office Depot and buy it yourself. Here, another cent saved for Hilton. \r\n-. Parking pricing is outrageous - I've parked cheaper in San-Francisco downtown, no discounts or anything for hotel guests - but don't expect that to mean easy and convenient parking. Parking lot is crammed, and spending -- minutes looking for a random place somebody didn't notice, or trying to fit your car into the space that nobody dared to use because it's too small - is routine. All while a bunch of spaces stay empty - but general public is not allowed there, probably so that they can charge you ---% for valet parking in the same spot, in addition to the outrageous price paid for the parking - which a lot of hotels of this class provide for free. In Hilton, I not only got charged for it - I got charged twice in one of the days. They can't even make their system work properly.\r\nSummarily, the personnel of the hotel was very nice, welcoming and pleasant. They did what they could. However, the hotel itself fell below the expectations - I paid more than I expected to pay for less than I expected to get from Hilton. I understand the economy is tough and everybody has to save, but saving on a couple of sheets of paper and a couple of tea bags is too much for me. When I go to a brand-name hotel like Hilton I don't expect that. After this stay I would think twice - no, a dozen times - before ever staying at a Hilton establishment again. Hope the savings were worth it.",
		"browser": "Mozilla",
		"device": "Desktop",
		"label": "negative"
	},
	{
		"id": 10346,
		"description": "Having stayed at many Hilton properties, I expect a friendly efficient service from what is considered a good brand.\r\nThis property was a let down. Initially, things went smoothly. Check-in was fine, as a HHonors Gold member I was informed with an apology that they did not have an Executive Floor to upgrade me to, but put me in a - bedroom suite and offered me a complimentary buffet breakfast and the usual wifi vouchers. This is where the good things ended.\r\nThe room had issues. Initially, the phone in the living room did not work. They sent someone up to fix the phone, and then some --- hours later it just started randomly producing high pitched beeps (which in turn woke me up). In addition, the guest compendium was empty (as in someone had removed the pages). It took - phone calls and - people to come up to my room to actually understand what I was requesting, and deliver a full compendium.\r\nI also had cause to contact and visit the front desk at various stages later in the evening during my stay. To say the night staff were next to useless would be an over-statement. The night manager basically said nothing to my requests, or as little as possible. They treated me like I was putting them out of their way and disrupting them being lazy. One particular staff member was so bad I wrote a separate complaint to Hilton about them.\r\nI also witnessed a lady in obvious distress attempting to get a room late one evening. When they informed her she was not able to get a room without photo ID she became upset and aggravated. She ranted a little bit about 'if I get murdered tonight, it'll be on your conscious' to which the night manager replied \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"That's ok Ma'am, I have no conscious\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\". \r\nI've never seen such rude staff. Would I stay there again? Definitely not by choice.",
		"browser": "Firefox",
		"device": "Mobile",
		"label": "negative"
	},
	{
		"id": 10348,
		"description": "I very much wanted to stay at a boutique hotel near Times Square in lieu of a Hilton or Marriott type. After some research, hubby and I compromised on The Paramount after seeing the price of their modern chic rooms on the website. When we checked in we were both excited about the impressive lobby. Very us. BUT we were royally disappointed when we entered our King Deluxe room. Womp womp womp...\r\nI'm normally a very flexible-laid back, go with the flow gal but this just wasn't what I was expecting at all.\r\nThe pictures seemed to be photo shopped bright and welcoming on the website. In reality, the room was entirely too small and the bathroom lacked a lot of luster. The room just seemed so dark and small. Just NOT what we had in mind for our - night NYC experience. The money spent renovating this hotel was obviously poured into the more public areas of the hotel. The closet would better be described as a compartment to store ~- jackets so our suitcases took up the little floor space we had.\r\nWe headed downstairs and explained our concerns and requested upgrade options. I inquired about their Entertainment and Couture suites displayed on their website as they are the only ones displayed. Do you know what they told me?! The available suites displayed on their website are only used for corporate events and fashion shoots. I was dumbfounded. I encouraged them to provide keys to the suite that they DO have available for purchase so that I can see it before we accept the upgrade for an additional $--- for our - nights in NYC. We saw it and it was another womp womp womp. They had simply take a wall and corned off - rooms at the end of the hallway. Even the rooms still had the heavy secure hotel door separating the bedroom from the living room AND the exit sign still existed in the cornered off wasted space in the entrance of the suite. The bedroom in the suite had a double bed. My husband and I are very tall and we by no means intend to share a double bed while paying for a suite. Desperately trying to see the positive, I looked out the window to see if our view had been upgraded. View from Times Square? It had been a bit but a partial view of lights from Times Square and the back of a billboard just wasn't worth it to me. Womp womp womp.\r\nWe headed back downstairs, handed them the suite key and stated that we will only be spending - night at The Paramount and would be checking out the following day. (Obviously, it was too late to cancel our room that night and not pay a fee, etc.) The customer service was very kind so I hadn’t the heart to share my disappointment. I'm sure it was obvious by our actions at that point.\r\nI've attached a picture of my hubby stretching out his hands so that you get an idea of just how small the King Deluxe room is. Note our luggage covering the entire opposite side of the bed. No point in showing you the view out the window, it was the back of a building.\r\nIf you care to know:\r\nNYC was insanely booked everywhere last week. We did manage to secure - nights at The Bowery (LOVED it, ---% guarantee that we will return) and the - other nights of our trip were spent at the Marriott on Times Square with an incredible view of Times Square.",
		"browser": "Edge",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10351,
		"description": "We stayed at this hotel for two nights over the busy Labor Day weekend. \r\nWe arrived at about -:--am after flying in on a red eye. Our room wasn't ready but we were told that since the housekeeping staff began at -:--am, and that the guests previously in our room had already checked out, that our room would be ready for us by --:--am. We went to breakfast and returned at --:-- and were told that our room was still not ready. We waited another ninety minutes and checked back with the front desk and were told that they would put a rush on our room with housekeeping, that they were in the process of cleaning it, and to come back in a half an hour. We did, and the room still wasn't ready. By that time we were both exhausted and perhaps the front desk person took pity on us and upgraded us to a junior suite. \r\nThe room was quite large especially for New York hotel rooms. We had views of the street from two sides, which we enjoyed, but it was noisy. It didn't bother us, but I think it would wake up a light sleeper. The bed was comfortable and the reading lights had dimmers. The desk was large and had a power strip.\r\nWe chose this hotel over the other InterContinental in New York City because of the price, location, and previous reviewer's glowing comments. There were a few little details that just didn't compare with previous experience we've had with this hotel brand.\r\nThe furniture looked a bit shabby with scuff marks on the table and tired looking furniture, chipped paint. The bathroom had a light fixture hanging loosely from the ceiling. There was some mold on the ceiling in the shower area. There were a couple of times that I had to wait over five minutes for hot water in the bathroom and the bathroom sink had a constant drip. One of our towels had a large hole in it. I know it sounds like nit-picking, but I've become accustomed to a certain level of expectations when staying at an InterContinental hotel, and for the reasons above, the Barclay didn't meet those expectations, in my opinion.",
		"browser": "Opera",
		"device": "Mobile",
		"label": "negative"
	},
	{
		"id": 10329,
		"description": "Stayed here with husband and sons on the way to an Alaska Cruise. We all loved the hotel, great experience. Ask for a room on the North tower, facing north west for the best views. We had a high floor, with a stunning view of the needle, the city, and even the cruise ships! We ordered room service for dinner so we could enjoy the perfect views. Room service dinners were delicious, too! You are in a perfect spot to walk everywhere, so enjoy the city. Almost forgot- Heavenly beds were heavenly, too!",
		"browser": "InternetExplorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10331,
		"description": "We had - rooms. One was very nice and clearly had been updated more recently than the other. The other was clean and the bed was comfy but it needed some updating (carpet was old and wrinkled for example). Great location for visiting Inner Harbor, getting to Fells Point, Orioles games etc. SuperShuttle from BWI worked great both ways. TV remotes in both rooms were terrible but we didn't watch much TV so not a big deal. Wireless was sketchy on --th and --th floors but again, didn't need it much - we were on vacation so it didn't really matter. Breakfast was good each morning. Would stay again if in town.",
		"browser": "InternetExplorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10333,
		"description": "My wife & I stayed in this glorious city a while back. SF is expensive, but we found this little hotel in a super location for a very reasonable price. By no means is it a --star hotel, but the room was clean, nice & well-appointed with quaint charm, despite being a bit small. Regardless of that, the staff was very helpful. I particularly enjoyed the wine-tasting evenings & the helpful, polite front desk.\r\nOverall, I'd recommend this place for singles or couples, but for children present, you probably need a bit bigger room. For the location & proximity to everything (including a marvelous little Mexican restaurant around the corner), you can't beat this place for the price. SF is a magical city with plenty of things to do, so I'd recommend just crashing here & seeing the wonderful surroundings more than hanging out in a room all day.\r\nWould recommend again for a getaway for -, but not for families because of the room size.",
		"browser": "Google Chrome",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10334,
		"description": "My boyfriend and I stayed at the Fairmont on a recent trip to San Francisco. I could not recommend this hotel more. \r\nI called the hotel a few weeks before to order a cake to be delivered to our room on our first night to celebrate my boyfriend's birthday. I was immediately connected directly to the pastry chef who helped me to design the most delicious cake I have ever eaten in my entire life! \r\nThe rooms are large and luxurious with a wonderful old-world feel. \r\n Most importantly don't miss a dinner at the Tonga Room! What a fun restaurant. Definitely order a Scorpion Bowl, but only if you’re staying in the hotel -- they're strong!!",
		"browser": "Internet Explorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10336,
		"description": "Steps off Times Square, nice rooms, stayed - nights, great for a short visit.",
		"browser": "Internet Explorer",
		"device": "Tablet",
		"label": "positive"
	},
	{
		"id": 10337,
		"description": "Me, the Wife and - kids stayed here on Valentine's weekend ----. Really a nice hotel in a great location. It is connected to the Rivercenter Mall in downtown San Antonio. It is within walking distance of all Downtown SA attractions, (Alamo, Riverwalk, Ripley's, ETC.) Great Service from the staff from beginning to end. I definitely HIGHLY recommend this hotel and would stay here again if ever in San Antonio for any reason.",
		"browser": "IE",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10339,
		"description": "I highly recommend the Hawthorne Terrace as an affordable, comfortable spot in Chicago. The staff were pleasant, the room clean and spacious, and I really liked the neighborhood location. Tons of bars, restaurants, an improv spot and Wrigley Field are all within walking distance.\r\nWhile the hotel provides a Continental breakfast, I'd recommend going across the street (at least once) to Anne Sather's. The hotel also offers free wireless Internet access in the rooms. I would definitely stay here again!",
		"browser": "Internet Explorer",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10340,
		"description": "I found the hotel clean and nicely located. Good, free shuttle to the airport leaves twice per hour. The rooms aren't as nicely appointed as other springhill suited I have stayed at. The walls were thin I could hear a lot from adjacent rooms.",
		"browser": "Chrome",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10341,
		"description": "Stayed at the Elan from --th to --th October and, as we liked it so much, returned there after our - day trip to Vegas for another - nights. Unassuming in appearance, the hotel scores heavily for its great location, spotlessly clean, classically designed and very comfortable bedrooms, and the friendliness of management and staff. Jorge and his colleagues on the front desk were a revelation with their untiring and enthusiastic help in recommending great restaurants, places to visit etc. And management were particularly helpful in letting us have a complimentary room post-check out to freshen up for our evening flight home after a long day enjoying the Southern Cal sunshine.",
		"browser": "Mozilla",
		"device": "Desktop",
		"label": "positive"
	},
	{
		"id": 10344,
		"description": "We stayed here for - nights and were really happy with it. It is located about --mins walk from the walk of fame and graumanns chinese theatre and is on most of the tour companie's pick up routes. Our room was nice and big and was very clean. Breakfast was included and it was really nice, the usual toast, cereal, pastries and cooked things. You also get free use of their internet in the business centre, as well as the gym and pool. The reception staff were really helpful in givin us directions etc. There is a minimart, subway and starbucks just across the road which is convenient. Also just off the walk of fame is a shopping mall with shops like Gap, Superdry, etc. There are also a few restaurants there as well. For anyone who likes pizzas I would recommend visiting the California Pizza Kitchen at the mall - pizzas are lush there and are rasonably priced. We got a shared bus to the hotel through Super Shuttle. It cost approx $-- return and pick ups occur every ----- mins from airport. Be warned of the way they drive tho, it was a slightly frightening experience after -- hours on a plane! \r\nWe didnt have a car there so did all organised tours, one through VIP tours and one through Starline Tours. The VIP tour was a tour of LA including Hollywood, Venice Beach, Downtown LA and Beverly HIlls. This lasted approx --- day and was really worth the money. We then did an escorted trip to Universal with Starline which was well organised and Universal is worth visiting!! We also went to Madame Tussauds on the walk of fame which had some good and bad statues!!\r\nOverall though the Holiday Inn Walk of Fame is worth staying at, its clean, convenient and has some nice free extras thrown in!!",
		"browser": "Google Chrome",
		"device": "Mobile",
		"label": "positive"
	},
	{
		"id": 10330,
		"description": "My girlfriends and I stayed here to celebrate our --th birthdays. We had planned this weekend getaway back in February, so we were all looking forward to it. There was - of us so we rented - ajoining rooms at the rate of $----night-room. We stayed - nights so with taxes and parking charges we spent in total over $----. All of us expected a certain level of service since we were staying at the Ritz, however this hotel certainly didn't meet what we would consider Ritz standards.\r\nThe rooms were fine. They were clean with well appointed bathrooms, but nothing to get excited about. The service however was awful. The first night we were there, I made -- calls to the bell man, before someone in hotel communications picked up the phone. Then on Saturday night before we left for dinner at -:--, we requested to have extra hotels delivered to our room and our trash removed. When we returned at --:--, neither request was fullfilled. I made another call to housekeeping and then finally things were taken care of. In my opinion, for the rates we were paying, we should have had nightly turn down service.\r\nI did speak with a manager when we checked out and he said he would make it worth our while to return, however all we received was a letter of apology.\r\nNeedless to say, we have no plans to return to this hotel. My husband and I stayed at the Four Seasons Boston in February of ---- and had a wonderful stay. The service there was impeccable as is service at all the Four Seaons that I have stayed at. If you are willing to pay Ritz Carlton prices, then I would recommend staying at the Four Seasons instead!",
		"browser": "Edge",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10332,
		"description": "My husband and I have stayed in this hotel a few times. Though not the fanciest hotel, we love the fact that we can walk the - or so miles to Fenway. It is clean and the staff is very accomodating. My only complaint is that the fan in the bathroom was noisy and went on automatically when you turned the light on and we tried to keep the light off as much as possible. We've stayed in pricier hotels which charged for internet and breakfast and these are both included. Will stay there again.",
		"browser": "Firefox",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10335,
		"description": "Wonderful staff, great location, but it was definately the price was high for a standard hotel. The free breakfast was great, actually pretty good quailty for a free buffet. This hotel is in the heart of it all, walking distance to everything. - things, please Hyatt...the coffee was bad and the white ginger line of shampoo-conditioner-soap smells horrible!",
		"browser": "Chrome",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10338,
		"description": "We stay at the Jolly Madison over the Xmas period, the main feature is it's location. You are never far from most tourist attractions from this hotel. Grand Central Station is a short walk and gets you to other places you can't get to by walking (cheaper than yellow cabs - although you should also give this a go. We booked a cab with the hotel to take us back to the airport upon our departure and we got a limo - what a way to leave New York! This was certainly better than our inward travel. Got a transfer just outside the airport and spent -- minutes driving between terminals collecting other fares before arriving back at our original terminal and heading off to our hotel.\r\nOur room was on a top floor high which was great as it meant less traffic and street noise. We had some problems with the heater in our room but the reception staff eventually resolved this by providing us with a portable heater.\r\nWe did not eat at the hotel at all because diners and deli's are available in close proximity. The best meals we found were in China Town and at Planet Holywood. If you are planning to go to Planet Hollywood negotiate a travel within the main section of the restaurant before being shown to your table otherwise you may end up like us on the top floor overlooking the action and not in it.\r\nWe took part in typical tourist activities such as Ripleys and the CSI Experience. Disappointed with both unfortunately. Had hoped to see a broadway play but we left it to late and the only available tickts were $--- each. If you ant to get to the to of the Empire State bilding would suggest going early as the queue by mid-day will take at least an hour. The boat trips around New York are great and the best way to see the Statue of Liberty, The Brooklyn Bridge etc.\r\nMake sure you book the ---- Memorial at reception. Although very emotional it gives you a true understanding of the events which took place and an appreciation for life and the spirit of New Yorkers.\r\nThe store window displays, Xmas trees and ice skating rings are just amazing over Xmas. Ice skating on Xmas Eve on Xmas day was definetely a highlight and the Hot Chocolate with marshmallows and whipped cream is wonderful. Do be careful if paying for a padlock for the lockers. I forgot where ours was and soehow managed to gain access to someone elses ;-(\r\nStumbling across Times Square one evening whilst taking a stroll was enlightening literally. All of a sudden he colour of the sky was bright. There are so many illuminated signs and this area has a real buzz at night time. Didn't care too much for the hoards of people here during the day though.\r\nWe did use the hotel bar on our last evening. The bar man was nice and friendly. The bar room was a little odd and resembled a chapel or such like.\r\nWe were surprised at just how many people there were and how many shops remained open on Xmas day. This really is the town that does not sleep.\r\nOur only regret was not having longer than - days but there is always next time.",
		"browser": "Edge",
		"device": "Mobile",
		"label": "negative"
	},
	{
		"id": 10342,
		"description": "Priceline sent us to this hotel after accepting the bid at --- USD a night, tax included. We checked in the night before Thanksgiving with a family of four including my --year and --year old boys. Upon inquiry, the hotel staff gave us a room at the lowest level, the --th floor, facing Time Square. While this is a standard room at this hotel, we had a pleasant surprise the very next morning to watch the entire Macy's Thanksgiving Day Parade from the comfort of our room. The location of this hotel is just impeccable. I highly recommend those who wish to celebrate special events near Time Square to stay there. Maybe we will do it again for the New Year count down.",
		"browser": "Mozilla",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10343,
		"description": "Old and cheap furnitures,our chair was simply destroyed,old painting on the wall,you feel like you are back in the --'s not ----...Kids running non stop early morning next to our door starting -am...The entire room shake...And for $---.....I don't think so!",
		"browser": "Google Chrome",
		"device": "Desktop",
		"label": "negative"
	},
	{
		"id": 10345,
		"description": "The service was fine, but the hotel itself fell way below my expectations from such a respectable establishment as Hilton. They were nickel-and-diming me all the way. \r\n-. The carpet in the corridor is not very clean and it smelled weird there. The pool area was no better - actually, much worse. I wouldn't recommend going barefoot anywhere in that area. It's just dirty.\r\n-. The coffee maker in the room was broken - it made --- cup of coffee and then turned off. So if you want a full cup, you have to ask it - times. Of course, by then the cup is almost all cold. Good luck making tea with it, if you don't like ice tea.\r\n-. Once we have used the provided tea packs, room service didn't bother to replace them. Probably saved them a cent or so.\r\n-. There's no free internet access in the business center and no free printing. I am staying in various hotels a lot and wasn't used before to being charged dollar-a-minute for printing a simple page of driving directions. I was used to getting it for free, as it was in most hotels of this class I visited. Hilton, however, decided to save yet another ---- of a cent.\r\n-. Most hotels provide some sort of paper for the guests to write on. Hilton has post-it notes. Literally - tiny squares of paper, and that's it. If you want to write down something that's not - words - good luck, Hilton is not going to help, go find an Office Depot and buy it yourself. Here, another cent saved for Hilton. \r\n-. Parking pricing is outrageous - I've parked cheaper in San-Francisco downtown, no discounts or anything for hotel guests - but don't expect that to mean easy and convenient parking. Parking lot is crammed, and spending -- minutes looking for a random place somebody didn't notice, or trying to fit your car into the space that nobody dared to use because it's too small - is routine. All while a bunch of spaces stay empty - but general public is not allowed there, probably so that they can charge you ---% for valet parking in the same spot, in addition to the outrageous price paid for the parking - which a lot of hotels of this class provide for free. In Hilton, I not only got charged for it - I got charged twice in one of the days. They can't even make their system work properly.\r\nSummarily, the personnel of the hotel was very nice, welcoming and pleasant. They did what they could. However, the hotel itself fell below the expectations - I paid more than I expected to pay for less than I expected to get from Hilton. I understand the economy is tough and everybody has to save, but saving on a couple of sheets of paper and a couple of tea bags is too much for me. When I go to a brand-name hotel like Hilton I don't expect that. After this stay I would think twice - no, a dozen times - before ever staying at a Hilton establishment again. Hope the savings were worth it.",
		"browser": "Mozilla",
		"device": "Desktop",
		"label": "negative"
	},
	{
		"id": 10346,
		"description": "Having stayed at many Hilton properties, I expect a friendly efficient service from what is considered a good brand.\r\nThis property was a let down. Initially, things went smoothly. Check-in was fine, as a HHonors Gold member I was informed with an apology that they did not have an Executive Floor to upgrade me to, but put me in a - bedroom suite and offered me a complimentary buffet breakfast and the usual wifi vouchers. This is where the good things ended.\r\nThe room had issues. Initially, the phone in the living room did not work. They sent someone up to fix the phone, and then some --- hours later it just started randomly producing high pitched beeps (which in turn woke me up). In addition, the guest compendium was empty (as in someone had removed the pages). It took - phone calls and - people to come up to my room to actually understand what I was requesting, and deliver a full compendium.\r\nI also had cause to contact and visit the front desk at various stages later in the evening during my stay. To say the night staff were next to useless would be an over-statement. The night manager basically said nothing to my requests, or as little as possible. They treated me like I was putting them out of their way and disrupting them being lazy. One particular staff member was so bad I wrote a separate complaint to Hilton about them.\r\nI also witnessed a lady in obvious distress attempting to get a room late one evening. When they informed her she was not able to get a room without photo ID she became upset and aggravated. She ranted a little bit about 'if I get murdered tonight, it'll be on your conscious' to which the night manager replied \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"That's ok Ma'am, I have no conscious\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\". \r\nI've never seen such rude staff. Would I stay there again? Definitely not by choice.",
		"browser": "Firefox",
		"device": "Mobile",
		"label": "negative"
	},
	{
		"id": 10348,
		"description": "I very much wanted to stay at a boutique hotel near Times Square in lieu of a Hilton or Marriott type. After some research, hubby and I compromised on The Paramount after seeing the price of their modern chic rooms on the website. When we checked in we were both excited about the impressive lobby. Very us. BUT we were royally disappointed when we entered our King Deluxe room. Womp womp womp...\r\nI'm normally a very flexible-laid back, go with the flow gal but this just wasn't what I was expecting at all.\r\nThe pictures seemed to be photo shopped bright and welcoming on the website. In reality, the room was entirely too small and the bathroom lacked a lot of luster. The room just seemed so dark and small. Just NOT what we had in mind for our - night NYC experience. The money spent renovating this hotel was obviously poured into the more public areas of the hotel. The closet would better be described as a compartment to store ~- jackets so our suitcases took up the little floor space we had.\r\nWe headed downstairs and explained our concerns and requested upgrade options. I inquired about their Entertainment and Couture suites displayed on their website as they are the only ones displayed. Do you know what they told me?! The available suites displayed on their website are only used for corporate events and fashion shoots. I was dumbfounded. I encouraged them to provide keys to the suite that they DO have available for purchase so that I can see it before we accept the upgrade for an additional $--- for our - nights in NYC. We saw it and it was another womp womp womp. They had simply take a wall and corned off - rooms at the end of the hallway. Even the rooms still had the heavy secure hotel door separating the bedroom from the living room AND the exit sign still existed in the cornered off wasted space in the entrance of the suite. The bedroom in the suite had a double bed. My husband and I are very tall and we by no means intend to share a double bed while paying for a suite. Desperately trying to see the positive, I looked out the window to see if our view had been upgraded. View from Times Square? It had been a bit but a partial view of lights from Times Square and the back of a billboard just wasn't worth it to me. Womp womp womp.\r\nWe headed back downstairs, handed them the suite key and stated that we will only be spending - night at The Paramount and would be checking out the following day. (Obviously, it was too late to cancel our room that night and not pay a fee, etc.) The customer service was very kind so I hadn’t the heart to share my disappointment. I'm sure it was obvious by our actions at that point.\r\nI've attached a picture of my hubby stretching out his hands so that you get an idea of just how small the King Deluxe room is. Note our luggage covering the entire opposite side of the bed. No point in showing you the view out the window, it was the back of a building.\r\nIf you care to know:\r\nNYC was insanely booked everywhere last week. We did manage to secure - nights at The Bowery (LOVED it, ---% guarantee that we will return) and the - other nights of our trip were spent at the Marriott on Times Square with an incredible view of Times Square.",
		"browser": "Edge",
		"device": "Tablet",
		"label": "negative"
	},
	{
		"id": 10351,
		"description": "We stayed at this hotel for two nights over the busy Labor Day weekend. \r\nWe arrived at about -:--am after flying in on a red eye. Our room wasn't ready but we were told that since the housekeeping staff began at -:--am, and that the guests previously in our room had already checked out, that our room would be ready for us by --:--am. We went to breakfast and returned at --:-- and were told that our room was still not ready. We waited another ninety minutes and checked back with the front desk and were told that they would put a rush on our room with housekeeping, that they were in the process of cleaning it, and to come back in a half an hour. We did, and the room still wasn't ready. By that time we were both exhausted and perhaps the front desk person took pity on us and upgraded us to a junior suite. \r\nThe room was quite large especially for New York hotel rooms. We had views of the street from two sides, which we enjoyed, but it was noisy. It didn't bother us, but I think it would wake up a light sleeper. The bed was comfortable and the reading lights had dimmers. The desk was large and had a power strip.\r\nWe chose this hotel over the other InterContinental in New York City because of the price, location, and previous reviewer's glowing comments. There were a few little details that just didn't compare with previous experience we've had with this hotel brand.\r\nThe furniture looked a bit shabby with scuff marks on the table and tired looking furniture, chipped paint. The bathroom had a light fixture hanging loosely from the ceiling. There was some mold on the ceiling in the shower area. There were a couple of times that I had to wait over five minutes for hot water in the bathroom and the bathroom sink had a constant drip. One of our towels had a large hole in it. I know it sounds like nit-picking, but I've become accustomed to a certain level of expectations when staying at an InterContinental hotel, and for the reasons above, the Barclay didn't meet those expectations, in my opinion.",
		"browser": "Opera",
		"device": "Mobile",
		"label": "negative"
	}
]
